Repository: commandus/mgp
Catalog: po/mkdb.*.UTF-8.po
Languages: ru

source: <connection-string>
ru: <соединение>

source: Set database connection string
ru: Строка соединения с СУБД

source: Set locale. Default ru
ru: Задать локаль. По умолчанию ru

source: Clean existing database
ru: Очистить базу данных

source: Verbose level
ru: Детализация вывода

source: Show this help
ru: Показать этот экран справки

source: Usage:
ru: Применение:

source: make database utility
ru: утилита создания базы данных

source: housing
ru: корпус

source: voltage
ru: напряжение

source: current
ru: ток

source: power
ru: мощность

source: precision
ru: точность

source: description
ru: описание

source: Error filling schema :
ru: Ошибка заполнения схемы:

source: Unknown error filling schema
ru: Неизвестная ошибка заполнения схемы

source: Error create schema:
ru: Ошибка создания схемы:

source: Unknown error create schema
ru: Неизвестная ошибка создания схемы

source: Admin user SYSDBA created with password "masterkey"
ru: Пользователь SYSDBA с правами администратора создан с паролем "masterkey"

source: Database is not supported
ru: СУБД не поддерживается
