Repository: commandus/mgp
Catalog: po/rcr-cli.*.UTF-8.po
Languages: ru

source: help Help screen quit Exit symbol Component type and symbol list symbol * Set all component types symbol D Set component symbol D (integrated circuits) box Box list box + 21-1 spare Add box 21-1 named "spare" box - 21-1 Remove box box = 21-1 newname Change box 21-1 box / 21-1 22 Rename box 21-1 to 22 box / 1-1 2 new Rename box 1-1 to 2 and assign a name property Properties list property = A accu Set property accu with shortkey A property + B bat Add property property - A Remove property user Registered users import <path> Preview spreadsheets in the path import <path> R 42 Import resistors (symbol R) from spreadsheets in the path to box 42 .. no-num Do not read box number from Excel file name D* Search by name starting with 'D' 100 kOhm Search resistors by nominal 1 mF 119 Search capacitor by nominal in boxes 119-.. * 119 Search all in boxes 119-.. * 119-1 K:DIP Search all in box 119-1 DIP
ru: help Справка quit Выход symbol Список типов компонентов symbol * Отменить фильтр типов компонентов (все типы) symbol D Показывать только компоненты типа D (интегральные микросхемы) box Список коробок box + 21-1 spare Добавить коробку 21-1 с названием "spare" box - 21-1 Удалить коробку box = 21-1 newname Изменить название коробки box / 21-1 22 Переименовать коробку 21-1 в 22 box / 1-1 2 new Переименовать коробку 1-1 в 2 и назначить имя property Список свойств property = A accu Задать название 'accu' свойству с коротким именем 'A' property + B bat Добавить свойство property - A Удалить свойство user Список пользователей import <path> Показать Excel по заданному пути import <path> R 42 Импортировать резисторы (тип R) из Excel по заданному пути в коробку 42 .. no-num Не использовать номер в имени файла Excel D* Найти компоненты по имени, начинающимумся с буквы 'D' 100 кОм Найти резисторы 100 кОм 1 мкФ 119 Найти конденсаторы 1 мкФ в коробке 119-.. * 119 Найти все компоненты в коробке 119-.. * 119-1 K:DIP Найти все в коробке со свойством корпус DIP

source: *.xlsx files found in '
ru: *.xlsx найдены в '

source: names,
ru: наименований,

source: items
ru: шт.

source: <service host name>
ru: <адрес>

source: service host name or IP address.
ru: имя или IP адрес хоста сервиса.

source: service port. Default 50051
ru: номер порта сервиса. По умолчанию 50051

source: SSL on
ru: вкл SSL

source: <command>
ru: <команда>

source: <params>
ru: <запрос>

source: command parameter(params)
ru: параметр(запрос)

source: <user-name>
ru: <пользователь>

source: User login
ru: Логин

source: <password>
ru: <пароль>

source: User password
ru: Пароль пользователя

source: <box>
ru: <коробка>

source: box prefix e.g. 221-2
ru: префикс коробки, например, 119-2

source: <number>
ru: <число>

source: List offset 0.. Default 0
ru: смещение в списке (0..) По умолчанию 0

source: List size. Default 10000
ru: Размер списка. По умолчанию 10000

source: do not read box from Excel file name
ru: не искать номер коробки из имени файла Excel

source: <locale>
ru: <локаль>

source: Locale: intl, ru
ru: Локаль: intl, ru

source: Verbose level
ru: Уровень подробностей журнала

source: Show this help
ru: Показать этот экран справки

source: Usage:
ru: Использование:

source: rcr CLI client
ru: rcr клиент

source: success
ru: успешно

source: fail
ru: сбой

source: Enter help to see command list
ru: Введите help, чтобы посмотреть список доступных команд

source: Error:
ru: Ошибка:

source: Current user:
ru: Текущий пользователь:

source: Admin
ru: Администратор

source: Invalid arguments
ru: Неверные аргументы
