Repository: commandus/mgp
Catalog: po/rcr-svc.*.UTF-8.po
Languages: ru

source: SSL on
ru: SSL вкл

source: Server listening on
ru: Сервис слушает

source: Can not start server
ru: Сервис не смог запуститься

source: HTTP JSON port
ru: HTTP JSON порт

source: Interrupted..
ru: Прервано..

source: exit
ru: завершение работы

source: Signal
ru: Сигнал

source: <address>
ru: <адрес>

source: service IPv4 network interface address. Default 0.0.0.0 (all)
ru: IPv4 адрес сервиса. По умолчанию 0.0.0.0 (все доступные интерфейсы)

source: <port>
ru: <порт>

source: service port. Default 50051
ru: номер порта. По умолчанию 50051

source: <SQLite# database>
ru: <база данных SQLite>

source: database, default "rcr.db"
ru: база данных, по умолчанию "rcr.db"

source: <path>
ru: <путь>

source: web root path. Default './html'
ru: корневой путь папки www. По умолчанию './html'

source: database scheme
ru: схема СУБД

source: database user password
ru: пароль пользователя СУБД

source: database host. Default localhost
ru: имя хоста СУБД. По умолчанию localhost

source: database port. Default 5432
ru: порт СУБД. По умолчанию 5432

source: database options file
ru: файл опций СУБД

source: database socket. Default none.
ru: сокет СУБД. По умолчанию нет.

source: database client charset. Default utf8.
ru: кодовая страница клиента СУБД. По умолчанию utf8.

source: database client flags. Default 0.
ru: флаги клиента СУБД. По умолчанию 0.

source: enable SSL
ru: вкл SSL

source: start as daemon/service
ru: запустить процесс как демон

source: run JSON HTTP service
ru: запущен JSON HTTP сервис

source: HTTP service port number. Default 8050
ru: HTTP JSON номер порта. По умолчанию 8050

source: <directory>
ru: <директория>

source: plugins directory, default ./plugins
ru: директория плагинов, по умолчанию ./plugins

source: <string>
ru: <строка>

source: plugins options, default none
ru: опции плагина, по умолчанию нет

source: -v- verbose
ru: -v- подробный вывод

source: Show this help
ru: Показать это окно справки

source: Usage:
ru: Применение:

source: rcr GRPC service
ru: GRPC сервис rcr

source: database connection error. Usage:
ru: ошибка соединения с СУБД Применение:

source: Start as daemon, use syslog
ru: Запущено как демон, сообщения в syslog

source: Start as daemon
ru: Запустить процесс как демон

source: Invalid arguments
ru: Неверные аргументы

source: Permission denied
ru: Доступ запрещен

source: Loading object error, id:
ru: Ошибка загрузки объекта, идентификатор:

source: cause(
ru: причина(

source: what(
ru: что(

source: message:
ru: сообщение:

source: No grants to call
ru: Нет прав на выполнение

source: Not implemented
ru: Не реализовано

source: login plugins loaded:
ru: загружено login-плагинов:

source: from directory
ru: из директории

source: User already exists
ru: Пользователь уже существует

source: User does not exists
ru: Пользователь не существует

source: Invalid operation
ru: Неверная операция

source: change user error:
ru: ошибка изменения пользователя:

source: change user unknown error
ru: неизвестная ошибка изменения пользователя

source: Property already exists
ru: Свойство уже существует

source: Property does not exists
ru: Свойство не существует

source: change property error:
ru: ошибка изменения свойства:

source: change property unknown error
ru: неизвестная ошибка изменения свойства

source: get card error:
ru: ошибка получения карточки:

source: get card unknown error
ru: неизвестная ошибка получения карточки

source: chCard error:
ru: ошибка изменения карточки:

source: chCard unknown error
ru: неизвестная ошибка изменения карточки

source: list operations error:
ru: ошибка списка операций:

source: list operations unknown error
ru: неизвестная ошибка списка операций

source: list symbols error:
ru: ошибка списка типов компонент:

source: list symbols unknown error
ru: неизвестная ошибка списка типов компонент

source: list property error:
ru: ошибка списка свойств:

source: list property unknown error
ru: неизвестная ошибка списка свойств

source: list box error:
ru: ошибка списка коробок:

source: list box unknown error
ru: неизвестная ошибка списка коробок

source: Check credentials error:
ru: ошибка проверки прав

source: Check credentials unknown error
ru: неизвестная ошибка проверки прав

source: Set credentials error:
ru: ошибка установки прав

source: Set credentials unknown error
ru: неизвестная ошибка установки прав

source: Check credentials & set token error:
ru: ошибка проверки прав и установки токена безопасности

source: Check credentials & set token unknown error
ru: неизвестная ошибка проверки прав и установки токена безопасности

source: list user error:
ru: ошибка списка пользователей:

source: list user unknown error
ru: неизвестная ошибка списка пользователей

source: remove property error:
ru: ошибка удаления свойства:

source: remove property unknown error
ru: неизвестная ошибка удаления свойства

source: Box already exists
ru: Коробка уже существует

source: Box does not exists
ru: Коробка не существует

source: change box error:
ru: ошибка изменения коробки:

source: change box unknown error
ru: неизвестная ошибка изменения коробки

source: change package box error:
ru: ошибка изменения номера коробки:

source: change package box unknown error
ru: неизвестная ошибка изменения номера коробки

source: list journal error:
ru: ошибка записи в журнал:

source: list journal unknown error
ru: неизвестная ошибка записи в журнал

source: Box
ru: Коробка

source: Name
ru: Наименование

source: Quantity
ru: Количество

source: Label
ru: Марка

source: Card #
ru: Карточка №

source: Package #
ru: Пакет №
